app/auth/authenticate_user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "12345"], ["LIMIT", 1]]
---
    def user
      @user = User.find_by(username: username)