app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def messages
      contacts = Contact.all