app/controllers/experiences_controller.rb

    def create
        exp = Experience.create(exp_params)
---
INSERT INTO "experiences" ("user_id", "experiencia", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["experiencia", "prueba"], ["created_at", "2018-10-25 15:13:40.581416"], ["updated_at", "2018-10-25 15:13:40.581416"]]