app/controllers/helps_controller.rb

  def entity
    helps = Entity.all
---
SELECT "entities".* FROM "entities"