app/controllers/laws_controller.rb

SELECT "helps".* FROM "helps"
---
  def lawsuit
    laws = Help.all