app/controllers/remainings_controller.rb

  def cases
    cases = Case.all.last(5)
---
SELECT  "cases".* FROM "cases" ORDER BY "cases"."id" DESC LIMIT ?  [["LIMIT", 5]]