app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "profiles" ("nombre", "sexo", "fecha", "foto", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        user=User.create(params.permit(:username, :password))
        profile=Profile.new(profile_params)
        auth_token = AuthenticateUser.new(user.username, user.password).call
        response = { message: Message.account_created, auth_token: auth_token }
        profile.user=user
        profile.save